# parameters
nc: 6  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,15, 30,15, 15,30]  # P3/8
  - [56,19, 28,43, 93,30]  # P4/16
  - [46,95, 167,48, 110,155]
  - [383,136, 286,354, 609,255]  # P5/32

# yolov7x backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [40, 3, 1]],  # 0
  
   [-1, 1, Conv, [80, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [80, 3, 1]],
   
   [-1, 1, Conv, [160, 3, 2]],  # 3-P2/4  
   [-1, 1, C3,[160]],
   [-1, 1, Conv, [320, 3, 2]],  # 13 5
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [160, 1, 1]],
   [-3, 1, Conv, [160, 1, 1]],
   [-1, 1, Conv, [160, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 18-P3/8   10
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -7, -8], 1, Concat, [1]],
   [-1, 1, Conv, [640, 1, 1]],  # 28  20
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [320, 1, 1]],
   [-3, 1, Conv, [320, 1, 1]],
   [-1, 1, Conv, [320, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 33-P4/16   25
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -7, -8], 1, Concat, [1]],
   [-1, 1, Conv, [1280, 1, 1]],  # 43 35
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [640, 1, 1]],
   [-3, 1, Conv, [640, 1, 1]],
   [-1, 1, Conv, [640, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 48-P5/32  40
   [-1, 1, C3, [1280]],
   [-1, 1, Conv, [320, 3, 1]],  # 58 42
  ]

# yolov7x head
head:
  [[-1, 1, SPPCSPC, [640]], # 59 43
  
   [-1, 1, Conv, [320, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [35, 1, Conv, [320, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, C3, [160]], # 73  48
   
   [-1, 1, Conv, [160, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [20, 1, Conv, [160, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, C3, [80]], # 87  53
   
   # ------------------------------------------------#
   [-1, 1, Conv, [80, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [5, 1, Conv, [80, 1, 1]], # route backbone P2
   [[-1, -2], 1, Concat, [1]],
 
   [-1, 1, C3, [80]], # 87 101 58
  # ------------------------------------------------#
   [-1, 1, MP, []],
   [-1, 1, Conv, [80, 1, 1]],
   [-3, 1, Conv, [80, 1, 1]],
   [-1, 1, Conv, [80, 3, 2]],
   [[-1, -3, 53], 1, Concat, [1]],
 
   [-1, 1, C3, [160]], # 100  116 64
  # ------------------------------------------------#


   
   [-1, 1, MP, []],
   [-1, 1, Conv, [160, 1, 1]],
   [-3, 1, CBAM, [160]],
   [-1, 1, Conv, [160, 3, 2]],
   [[-1, -3, 48], 1, Concat, [1]],
   
   [-1, 1, C3, [320]], # 102  131 70
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [320, 1, 1]],
   [-3, 1, Conv, [320, 1, 1]],
   [-1, 1, Conv, [320, 3, 2]],
   [[-1, -3, 43], 1, Concat, [1]],
   
   [-1, 1, C3, [160]], # 117  146 76
   
   [58, 1, Conv, [160, 3, 1]],
   [64, 1, Conv, [320, 3, 1]],
   [70, 1, Conv, [640, 3, 1]],
   [76, 1, Conv, [1280, 3, 1]],


   [[77,78,79,80], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
